Dataset used for Agriculture_analysis of India:https://www.kaggle.com/datasets/sanamps/crop-production-in-india

Dataset used for Employment_rate of India:https://data.worldbank.org/indicator/SL.AGR.EMPL.ZS?locations=IN

Firstly let me import pandas library for EDA and filling the missing values, as you could see below that i imported the Indian_Agriculture_crop_production (csv file) by assingning it to the df1 variable

In [1]:
import pandas as pd
df1 = pd.read_excel("Agriculture_India_1/Indian_Agriculture_Crop_Production(dirty-data).xlsx")
df1.head()

,State,District,Crop,Year,Season,Area,Area Units,Production,Production Units,Yield
0,Andaman and Nicobar Islands,NICOBARS,Arecanut,2001-02,Kharif,1254.0,Hectare,2061.0,Tonnes,1.643541
1,Andaman and Nicobar Islands,NICOBARS,Arecanut,2002-03,Whole Year,1258.0,Hectare,2083.0,Tonnes,1.655803
2,Andaman and Nicobar Islands,NICOBARS,Arecanut,2003-04,Whole Year,1261.0,Hectare,1525.0,Tonnes,1.209358
3,Andaman and Nicobar Islands,NORTH AND MIDDLE ANDAMAN,Arecanut,2001-02,Kharif,3100.0,Hectare,5239.0,Tonnes,1.690000
4,Andaman and Nicobar Islands,SOUTH ANDAMANS,Arecanut,2002-03,Whole Year,3105.0,Hectare,5267.0,Tonnes,1.696296

Furtherly let me also import the data file which is an agriculture Employment_rate of India yearly, which i used as an reference dataset for the Employment_rate for India

Dataset reference link :

https://api.worldbank.org/v2/en/indicator/SL.AGR.EMPL.ZS?downloadformat=csv

In the above link i used the 1st csv file as the reference dataset for the Employment_rate, which was an 'zip' file

In [2]:
data = pd.read_csv('Employment-Dataset/Employment_rate_of_agriculture_india(dirty-data).csv')
data.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1997,1998,1999,2000,2001,2002,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,ABW,Employment in agriculture (% of total employme...,SL.AGR.EMPL.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,Employment in agriculture (% of total employme...,SL.AGR.EMPL.ZS,65.019760,64.955504,64.795270,64.691640,64.630147,64.404074,...,59.550128,59.431113,58.598706,57.971761,57.53939,57.034653,56.497509,55.960579,56.530892,56.213783
2,Afghanistan,AFG,Employment in agriculture (% of total employme...,SL.AGR.EMPL.ZS,64.267360,64.614510,64.987190,65.471690,66.054870,64.087790,...,50.176820,47.640770,44.798540,44.651210,44.37642,43.989000,44.397120,44.512630,45.983410,NaN
3,Africa Western and Central,AFW,Employment in agriculture (% of total employme...,SL.AGR.EMPL.ZS,59.088167,58.595325,58.151071,57.523887,56.997332,56.502623,...,49.065101,48.415663,46.825039,45.629765,45.64358,45.179917,44.544132,44.313630,44.375664,43.869617
4,Angola,AGO,Employment in agriculture (% of total employme...,SL.AGR.EMPL.ZS,38.962050,38.657080,38.567960,38.241000,37.759670,36.570580,...,53.321230,55.516370,57.599660,57.963880,58.52023,58.834890,59.304860,59.334900,59.205560,58.657160

In the above data file i have removed some year by using excel and i kept the year which are only required for the reference

Since as you there are some unwanted columns are present let me remove using drop function

In [3]:
data = data.drop(['Country Code','Indicator Name','Indicator Code'],axis=1)

In [4]:
data.head()

,Country Name,1997,1998,1999,2000,2001,2002,2003,2004,2005,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,65.019760,64.955504,64.795270,64.691640,64.630147,64.404074,64.249594,64.022887,63.919564,...,59.550128,59.431113,58.598706,57.971761,57.53939,57.034653,56.497509,55.960579,56.530892,56.213783
2,Afghanistan,64.267360,64.614510,64.987190,65.471690,66.054870,64.087790,63.340150,63.051860,61.815350,...,50.176820,47.640770,44.798540,44.651210,44.37642,43.989000,44.397120,44.512630,45.983410,NaN
3,Africa Western and Central,59.088167,58.595325,58.151071,57.523887,56.997332,56.502623,55.805606,55.000015,54.420667,...,49.065101,48.415663,46.825039,45.629765,45.64358,45.179917,44.544132,44.313630,44.375664,43.869617
4,Angola,38.962050,38.657080,38.567960,38.241000,37.759670,36.570580,36.505830,36.166340,38.115510,...,53.321230,55.516370,57.599660,57.963880,58.52023,58.834890,59.304860,59.334900,59.205560,58.657160

As you could see that i was able to genrate the index values from 0 to 265 using for loop, for furthter cleaning

In [5]:
df_dirty_data = data

In [6]:
data.loc[109]

Country Name       India
1997            61.08086
1998            60.68718
1999            60.10669
2000            59.64473
2001            59.08598
2002            58.44382
2003             57.7151
2004            56.75876
2005            55.99824
2006            55.09983
2007            54.17196
2008             53.3906
2009            52.47509
2010            51.51537
2011            49.25777
2012            47.00424
2013            46.42778
2014             45.7835
2015            45.15931
2016            44.52136
2017            43.93962
2018            43.32882
2019            41.38738
2020            44.30447
2021            43.95999
Name: 109, dtype: object

In [7]:
for i in range(0,266):
    print(i,',',end='')

0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10 ,11 ,12 ,13 ,14 ,15 ,16 ,17 ,18 ,19 ,20 ,21 ,22 ,23 ,24 ,25 ,26 ,27 ,28 ,29 ,30 ,31 ,32 ,33 ,34 ,35 ,36 ,37 ,38 ,39 ,40 ,41 ,42 ,43 ,44 ,45 ,46 ,47 ,48 ,49 ,50 ,51 ,52 ,53 ,54 ,55 ,56 ,57 ,58 ,59 ,60 ,61 ,62 ,63 ,64 ,65 ,66 ,67 ,68 ,69 ,70 ,71 ,72 ,73 ,74 ,75 ,76 ,77 ,78 ,79 ,80 ,81 ,82 ,83 ,84 ,85 ,86 ,87 ,88 ,89 ,90 ,91 ,92 ,93 ,94 ,95 ,96 ,97 ,98 ,99 ,100 ,101 ,102 ,103 ,104 ,105 ,106 ,107 ,108 ,109 ,110 ,111 ,112 ,113 ,114 ,115 ,116 ,117 ,118 ,119 ,120 ,121 ,122 ,123 ,124 ,125 ,126 ,127 ,128 ,129 ,130 ,131 ,132 ,133 ,134 ,135 ,136 ,137 ,138 ,139 ,140 ,141 ,142 ,143 ,144 ,145 ,146 ,147 ,148 ,149 ,150 ,151 ,152 ,153 ,154 ,155 ,156 ,157 ,158 ,159 ,160 ,161 ,162 ,163 ,164 ,165 ,166 ,167 ,168 ,169 ,170 ,171 ,172 ,173 ,174 ,175 ,176 ,177 ,178 ,179 ,180 ,181 ,182 ,183 ,184 ,185 ,186 ,187 ,188 ,189 ,190 ,191 ,192 ,193 ,194 ,195 ,196 ,197 ,198 ,199 ,200 ,201 ,202 ,203 ,204 ,205 ,206 ,207 ,208 ,209 ,210 ,211 ,212 ,213 ,214 ,215 ,216 ,217 ,218 ,219 ,220 ,221 ,222 ,223 ,224 ,225 ,226 ,227 ,228 ,229 ,230 ,231 ,232 ,233 ,234 ,235 ,236 ,237 ,238 ,239 ,240 ,241 ,242 ,243 ,244 ,245 ,246 ,247 ,248 ,249 ,250 ,251 ,252 ,253 ,254 ,255 ,256 ,257 ,258 ,259 ,260 ,261 ,262 ,263 ,264 ,265 ,

By removing some unwanted values such as various countries , We do require only the Employment_rate of India so i removed the unwanted datas using excel

Since i used drop to drop the values of index, As i know that the index value of india is '109' i omitted it

In [8]:
data = data.drop([0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10 ,11 ,12 ,13 ,14 ,15 ,16 ,17 ,18 ,19 ,20 ,21 ,22 ,23 ,24 ,25 ,26 ,27 ,28 ,29 ,30 ,31 ,32 ,33 ,34 ,35 ,36 ,37 ,38 ,39 ,40 ,41 ,42 ,43 ,44 ,45 ,46 ,47 ,48 ,49 ,50 ,51 ,52 ,53 ,54 ,55 ,56 ,57 ,58 ,59 ,60 ,61 ,62 ,63 ,64 ,65 ,66 ,67 ,68 ,69 ,70 ,71 ,72 ,73 ,74 ,75 ,76 ,77 ,78 ,79 ,80 ,81 ,82 ,83 ,84 ,85 ,86 ,87 ,88 ,89 ,90 ,91 ,92 ,93 ,94 ,95 ,96 ,97 ,98 ,99 ,100 ,101 ,102 ,103 ,104 ,105 ,106 ,107 ,108 ,110 ,111 ,112 ,113 ,114 ,115 ,116 ,117 ,118 ,119 ,120 ,121 ,122 ,123 ,124 ,125 ,126 ,127 ,128 ,129 ,130 ,131 ,132 ,133 ,134 ,135 ,136 ,137 ,138 ,139 ,140 ,141 ,142 ,143 ,144 ,145 ,146 ,147 ,148 ,149 ,150 ,151 ,152 ,153 ,154 ,155 ,156 ,157 ,158 ,159 ,160 ,161 ,162 ,163 ,164 ,165 ,166 ,167 ,168 ,169 ,170 ,171 ,172 ,173 ,174 ,175 ,176 ,177 ,178 ,179 ,180 ,181 ,182 ,183 ,184 ,185 ,186 ,187 ,188 ,189 ,190 ,191 ,192 ,193 ,194 ,195 ,196 ,197 ,198 ,199 ,200 ,201 ,202 ,203 ,204 ,205 ,206 ,207 ,208 ,209 ,210 ,211 ,212 ,213 ,214 ,215 ,216 ,217 ,218 ,219 ,220 ,221 ,222 ,223 ,224 ,225 ,226 ,227 ,228 ,229 ,230 ,231 ,232 ,233 ,234 ,235 ,236 ,237 ,238 ,239 ,240 ,241 ,242 ,243 ,244 ,245 ,246 ,247 ,248 ,249 ,250 ,251 ,252 ,253 ,254 ,255 ,256 ,257 ,258 ,259 ,260 ,261 ,262 ,263 ,264 ,265])

In [9]:
data

,Country Name,1997,1998,1999,2000,2001,2002,2003,2004,2005,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
109,India,61.08086,60.68718,60.10669,59.64473,59.08598,58.44382,57.7151,56.75876,55.99824,...,47.00424,46.42778,45.7835,45.15931,44.52136,43.93962,43.32882,41.38738,44.30447,43.95999

In [10]:
data.isna().sum()

Country Name    0
1997            0
1998            0
1999            0
2000            0
2001            0
2002            0
2003            0
2004            0
2005            0
2006            0
2007            0
2008            0
2009            0
2010            0
2011            0
2012            0
2013            0
2014            0
2015            0
2016            0
2017            0
2018            0
2019            0
2020            0
2021            0
dtype: int64

Lastly you could see there are no null values present in the dataset let me save it as 'csv' file

In [11]:
data.to_csv('Employment_Rate_of_India.csv',index=False)

As you could see that i converted the data file into the required Employment_rate of India and i saved it in the form of csv file

Nexly i modified the 'csv' data file by transposing rows into columns and removing the index value which was year and transformed it into a  'Excel' data file

In [12]:
df2 = pd.read_excel("Employment-Dataset/Agriculture_Employment_Rate_Of_India.xlsx")
df2.head()

   Year  Employment_Rate
0  1997         61.08086
1  1998         60.68718
2  1999         60.10669
3  2000         59.64473
4  2001         59.08598

In [13]:
df_dirty_data.head()

,Country Name,1997,1998,1999,2000,2001,2002,2003,2004,2005,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,65.019760,64.955504,64.795270,64.691640,64.630147,64.404074,64.249594,64.022887,63.919564,...,59.550128,59.431113,58.598706,57.971761,57.53939,57.034653,56.497509,55.960579,56.530892,56.213783
2,Afghanistan,64.267360,64.614510,64.987190,65.471690,66.054870,64.087790,63.340150,63.051860,61.815350,...,50.176820,47.640770,44.798540,44.651210,44.37642,43.989000,44.397120,44.512630,45.983410,NaN
3,Africa Western and Central,59.088167,58.595325,58.151071,57.523887,56.997332,56.502623,55.805606,55.000015,54.420667,...,49.065101,48.415663,46.825039,45.629765,45.64358,45.179917,44.544132,44.313630,44.375664,43.869617
4,Angola,38.962050,38.657080,38.567960,38.241000,37.759670,36.570580,36.505830,36.166340,38.115510,...,53.321230,55.516370,57.599660,57.963880,58.52023,58.834890,59.304860,59.334900,59.205560,58.657160

So i was able to transform the above data into below required data, as you could see its the Employment_rate of India upto the year of 2021

In [14]:
df2.tail(10)

    Year  Employment_Rate
15  2012         47.00424
16  2013         46.42778
17  2014         45.78350
18  2015         45.15931
19  2016         44.52136
20  2017         43.93962
21  2018         43.32882
22  2019         41.38738
23  2020         44.30447
24  2021         43.95999

You may see that i got the data which i furtherly required to display the Employment_Rate of India (yearly)

So now let me import the main dataset "Indian_Agriculture_Crop_Production.csv"

In [15]:
df1.head()

,State,District,Crop,Year,Season,Area,Area Units,Production,Production Units,Yield
0,Andaman and Nicobar Islands,NICOBARS,Arecanut,2001-02,Kharif,1254.0,Hectare,2061.0,Tonnes,1.643541
1,Andaman and Nicobar Islands,NICOBARS,Arecanut,2002-03,Whole Year,1258.0,Hectare,2083.0,Tonnes,1.655803
2,Andaman and Nicobar Islands,NICOBARS,Arecanut,2003-04,Whole Year,1261.0,Hectare,1525.0,Tonnes,1.209358
3,Andaman and Nicobar Islands,NORTH AND MIDDLE ANDAMAN,Arecanut,2001-02,Kharif,3100.0,Hectare,5239.0,Tonnes,1.690000
4,Andaman and Nicobar Islands,SOUTH ANDAMANS,Arecanut,2002-03,Whole Year,3105.0,Hectare,5267.0,Tonnes,1.696296

Let me know what are the null values present in the dataset

In [16]:
df1.isna().sum()

State                  0
District               0
Crop                  32
Year                   0
Season                 1
Area                  33
Area Units             0
Production          4993
Production Units       0
Yield                 33
dtype: int64

As you could see there are more than 4000 null values in production

Now i import numpy module for filling up the null values present in the main dataset

In [17]:
import numpy as np

Also i do need to know about the data description so let me use describe funtion for better understanding

In [18]:
df1.describe()

               Area    Production          Yield
count  3.453740e+05  3.404140e+05  345374.000000
mean   1.167019e+04  9.583711e+05      79.407569
std    4.583843e+04  2.152986e+07     916.628744
min    4.000000e-03  0.000000e+00       0.000000
25%    7.400000e+01  8.700000e+01       0.546742
50%    5.320000e+02  7.170000e+02       1.000000
75%    4.110000e+03  7.176000e+03       2.467080
max    8.580100e+06  1.597800e+09   43958.333333

By the above values i was able to know that the mean is irrelevant to the dataset so let me use median insted in all the required fields

In [19]:
production_median = df1.Production.median()
production_median

717.0

In [20]:
area_median = df1.Area.median()
area_median

532.0

In [21]:
yield_median = df1.Yield.median()
yield_median

1.0

Now let me replace all the null values one by one for each fileds

In [22]:
df1["Area"] = df1.Area.replace(np.NaN,532)

In [23]:
df1["Yield"] = df1.Yield.replace(np.NaN,1)

In [24]:
df1["Production"] = df1.Production.replace(np.NaN,717.0)

Therefore in India Rice was the major crop produced among the world, thus i used 'Rice' in empty crop fields and replaced the null values with Rice

In [25]:
df1["Crop"] = df1.Crop.replace(np.NaN,"Rice")

In addition to that i would like to map the year accordingly to merge two datasets df1 and df2,the code as follows

In [26]:
new_data = { '1997-98':1997,
           '1998-99':1998,
           '1999-00':1999,
           '2000-01':2000,
           '2001-02':2001,
           '2002-03':2002,
           '2003-04':2003,
           '2004-05':2004,
           '2005-06':2005,
           '2006-07':2006,
           '2007-08':2007,
           '2008-09':2008,
           '2009-10':2009,
           '2010-11':2010,
           '2011-12':2011,
           '2012-13':2012,
           '2013-14':2013,
           '2014-15':2014,
           '2015-16':2015,
           '2016-17':2016,
           '2017-18':2017,
           '2018-19':2018,
           '2019-20':2019,
           '2020-21':2020}
 
df1["Year"] = df1["Year"].map(new_data)

In [27]:
df1.head()

,State,District,Crop,Year,Season,Area,Area Units,Production,Production Units,Yield
0,Andaman and Nicobar Islands,NICOBARS,Arecanut,2001,Kharif,1254.0,Hectare,2061.0,Tonnes,1.643541
1,Andaman and Nicobar Islands,NICOBARS,Arecanut,2002,Whole Year,1258.0,Hectare,2083.0,Tonnes,1.655803
2,Andaman and Nicobar Islands,NICOBARS,Arecanut,2003,Whole Year,1261.0,Hectare,1525.0,Tonnes,1.209358
3,Andaman and Nicobar Islands,NORTH AND MIDDLE ANDAMAN,Arecanut,2001,Kharif,3100.0,Hectare,5239.0,Tonnes,1.690000
4,Andaman and Nicobar Islands,SOUTH ANDAMANS,Arecanut,2002,Whole Year,3105.0,Hectare,5267.0,Tonnes,1.696296

You could see in the above dataset the year column has been changed accordingly

Now along with it let me also remove the outliers furtherly for better dataset

In [28]:
shape1 = df1.shape

In [29]:
production_quantile_max = df1.Production.quantile(0.984)
yield_quantile_max = df1.Yield.quantile(0.989)
area_quantile_max = df1.Area.quantile(0.99)

In [30]:
print('Production:'+str(production_quantile_max))
print('Yield:'+str(yield_quantile_max))
print('Area:'+str(area_quantile_max))

Production:803438.9840000134
Yield:98.57235899077216
Area:188415.04000000004

I removed datas if the values are above the mentioned values it will remove the datas for the betterment of dataset?

In [31]:
df1 = df1[(df1.Production <= production_quantile_max) & (df1.Yield <= yield_quantile_max) * (df1.Area <= area_quantile_max )]

In [32]:
production_quantile_min = df1.Production.quantile(0.01)
yield_quantile_min = df1.Yield.quantile(0.019)
area_quantile_min = df1.Area.quantile(0.01)

In [33]:
print('Production:'+str(production_quantile_min))
print('Yield:'+str(yield_quantile_min))
print('Area:'+str(area_quantile_min))

Production:1.0
Yield:0.02287870018275752
Area:1.0

I removed datas if the values are below the mentioned values it will remove the datas for the betterment of dataset

In [34]:
df1 = df1[(df1.Production >= production_quantile_min) & (df1.Yield >= yield_quantile_min) * (df1.Area >= area_quantile_min )]

 Let me know how many datas have been removed

In [35]:
shape2 = df1.shape

In [36]:
print('Original_dataset:',shape1)
print('Required_dataset:',shape2)

Original_dataset: (345407, 10)
Required_dataset: (329142, 10)

In [37]:
result = 345407-334416
print('Datas_removed:',result)

Datas_removed: 10991

In [38]:
df1.isna().sum()

State               0
District            0
Crop                0
Year                0
Season              1
Area                0
Area Units          0
Production          0
Production Units    0
Yield               0
dtype: int64

Counting the null values lastly i was able to know that there is only one data that has null value in it , so let me use dropna function to remove the column

In [39]:
df1 = df1.dropna()

Finally let me merge both the dataset df1 and df2 together assigned to final_dataset

In [40]:
final_dataset = pd.merge(df1,df2,on="Year")

In [41]:
final_dataset.head()

,State,District,Crop,Year,Season,Area,Area Units,Production,Production Units,Yield,Employment_Rate
0,Andaman and Nicobar Islands,NICOBARS,Arecanut,2001,Kharif,1254.0,Hectare,2061.0,Tonnes,1.643541,59.08598
1,Andaman and Nicobar Islands,NORTH AND MIDDLE ANDAMAN,Arecanut,2001,Kharif,3100.0,Hectare,5239.0,Tonnes,1.690000,59.08598
2,Andaman and Nicobar Islands,NICOBARS,Cashewnut,2001,Whole Year,719.0,Hectare,192.0,Tonnes,0.267038,59.08598
3,Andaman and Nicobar Islands,NORTH AND MIDDLE ANDAMAN,Cashewnut,2001,Whole Year,81.0,Hectare,33.0,Tonnes,0.407407,59.08598
4,Andaman and Nicobar Islands,NICOBARS,Ginger,2001,Whole Year,46.0,Hectare,100.0,Tonnes,2.173913,59.08598

Let me check if there are any null values in the dataset and save it

In [42]:
final_dataset.isna().sum()

State               0
District            0
Crop                0
Year                0
Season              0
Area                0
Area Units          0
Production          0
Production Units    0
Yield               0
Employment_Rate     0
dtype: int64

No null values have been found now let me save the dataset in csv format

In [43]:
final_dataset.to_excel('Agriculture_India_2/Agricultural_Analysis_Of_India.xlsx',index=False)

After the completion of cleaning the dataset ,i checked the name of states by that i was able to know that there is spelling mistake in ladakh and the daman and diu have been attached to each other so i retrieved it into a cleaned dataset using excel and converted it into csv file.